---
kind: method
id: M:Autodesk.Revit.DB.Material.ClearMaterialAspect(Autodesk.Revit.DB.MaterialAspect)
zh: 材质、材料
source: html/f5ff587a-d617-28e1-c277-1f73ccbe7e3a.htm
---
# Autodesk.Revit.DB.Material.ClearMaterialAspect Method

**中文**: 材质、材料

Removes an aspect from the material.

## Syntax (C#)
```csharp
public void ClearMaterialAspect(
	MaterialAspect aspect
)
```

## Parameters
- **aspect** (`Autodesk.Revit.DB.MaterialAspect`) - The material aspect.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration